eagletrt/fenice-bms-hv-sw/src/bms/fenice-bms.ioc
#MicroXplorer Configuration settings - do not modify
Mcu.Family=STM32G4
ProjectManager.MainLocation=Src
PA6.Mode=Full_Duplex_Master
RCC.USART1Freq_Value=170000000
USART2.RXFIFOThreshold=RXFIFO_THRESHOLD_FULL
SPI2.VirtualNSS=VM_NSSHARD
USART3.MSBFirstParam=ADVFEATURE_MSBFIRST_DISABLE
RCC.SAI1Freq_Value=170000000
USART2.IPParameters=VirtualMode-Asynchronous,BaudRate,FIFOMode,RXFIFOThreshold,TXFIFOThreshold,OverrunDisableParam
RCC.CortexFreq_Value=170000000
ProjectManager.KeepUserCode=true
Mcu.UserName=STM32G474CETx
SPI1.VirtualType=VM_MASTER
SPI2.VirtualType=VM_MASTER
PB10.Mode=Asynchronous
PA0.GPIO_Label=MUX_A2
PA12.GPIOParameters=GPIO_Label
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-SystemClock_Config-RCC-false-HAL-false,3-MX_FDCAN1_Init-FDCAN1-true-HAL-true,4-MX_SPI1_Init-SPI1-false-HAL-true,5-MX_SPI2_Init-SPI2-false-HAL-true,6-MX_USART2_UART_Init-USART2-false-HAL-true,7-MX_USART3_UART_Init-USART3-false-HAL-true
PA9.GPIOParameters=GPIO_Label
PA11.GPIOParameters=GPIO_Label
PB0.GPIO_Label=ADC_SIN
PB6.GPIO_Label=LED_2
RCC.USART2Freq_Value=170000000
PC13.GPIO_Label=ANALOG_DATA
PB11.Signal=USART3_RX
PB15.Signal=SPI2_MOSI
PB13.Signal=SPI2_SCK
PC15-OSC32_OUT.GPIO_Label=IP_HIGH
PinOutPanel.RotationAngle=0
RCC.MCO1PinFreq_Value=16000000
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
ProjectManager.StackSize=0x400
PB5.GPIOParameters=GPIO_Label
USART3.VirtualMode-Asynchronous=VM_ASYNC
RCC.I2C3Freq_Value=170000000
RCC.LPTIM1Freq_Value=170000000
Mcu.IP4=SPI2
RCC.FCLKCortexFreq_Value=170000000
Mcu.IP5=SYS
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.IP2=RCC
Mcu.IP3=SPI1
PA15.GPIO_Label=HOLD
Mcu.IP0=FDCAN1
PA12.Locked=true
Mcu.IP1=NVIC
PA12.Signal=GPIO_Input
USART3.BaudRate=500000
Mcu.UserConstants=
PA4.Mode=NSS_Signal_Hard_Output
Mcu.ThirdPartyNb=0
SPI1.Direction=SPI_DIRECTION_2LINES
RCC.HCLKFreq_Value=170000000
RCC.I2C4Freq_Value=170000000
Mcu.IPNb=8
ProjectManager.PreviousToolchain=
RCC.APB2TimFreq_Value=170000000
PB6.Signal=GPIO_Output
SPI1.CalculateBaudRate=664.062 KBits/s
Mcu.Pin6=PA1
Mcu.Pin7=PA2
Mcu.Pin8=PA3
Mcu.Pin9=PA4
RCC.AHBFreq_Value=170000000
SPI2.BaudRatePrescaler=SPI_BAUDRATEPRESCALER_128
PB13.Locked=true
Mcu.Pin0=PC13
Mcu.Pin1=PC14-OSC32_IN
GPIO.groupedBy=
Mcu.Pin2=PC15-OSC32_OUT
Mcu.Pin3=PF0-OSC_IN
RCC.USART3Freq_Value=170000000
Mcu.Pin4=PF1-OSC_OUT
Mcu.Pin5=PA0
ProjectManager.ProjectBuild=false
RCC.HSE_VALUE=8000000
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PA0.Locked=true
PF0-OSC_IN.GPIO_Label=CS_EEPROM
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PB2.Signal=GPIO_Output
USART2.VirtualMode-Asynchronous=VM_ASYNC
NVIC.SysTick_IRQn=true\:0\:0\:false\:false\:true\:false\:true
RCC.ADC12Freq_Value=170000000
PB12.GPIO_Label=CS_SD
ProjectManager.FirmwarePackage=STM32Cube FW_G4 V1.2.0
MxDb.Version=DB.5.0.60
PB0.GPIOParameters=GPIO_Label
PA1.GPIOParameters=GPIO_Label
ProjectManager.BackupPrevious=false
RCC.VCOInputFreq_Value=4000000
PF0-OSC_IN.Locked=true
PB14.Mode=Full_Duplex_Master
PB1.GPIO_Label=MUX_A1
File.Version=6
PA10.GPIO_Label=TS_ON
SPI2.CalculateBaudRate=1.328125 MBits/s
VP_SYS_VS_DBSignals.Mode=DisableDeadBatterySignals
PB7.Signal=GPIO_Output
RCC.PLLRCLKFreq_Value=170000000
SPI1.VirtualNSS=VM_NSSHARD
PB6.Locked=true
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PB6.GPIOParameters=GPIO_Label
NVIC.FDCAN1_IT1_IRQn=true\:0\:0\:false\:true\:true\:2\:true\:true
ProjectManager.HalAssertFull=false
PB0.Locked=true
PC14-OSC32_IN.GPIOParameters=GPIO_Label
RCC.CRSFreq_Value=48000000
ProjectManager.ProjectName=fenice-bms
PA0.Signal=GPIO_Output
USART2.FIFOMode=FIFOMODE_ENABLE
PB7.GPIO_Label=LED_1
Mcu.Package=LQFP48
PB9.Signal=FDCAN1_TX
PB1.Signal=GPIO_Output
PA6.Signal=SPI1_MISO
PB12.Mode=NSS_Signal_Hard_Output
SPI2.Mode=SPI_MODE_MASTER
PA14.Locked=true
ProjectManager.ToolChainLocation=
RCC.LSI_VALUE=32000
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
RCC.LSCOPinFreq_Value=32000
USART3.IPParameters=VirtualMode-Asynchronous,BaudRate,OverSampling,DataInvertParam,MSBFirstParam
PA10.Signal=GPIO_Output
PA15.Signal=GPIO_Output
USART2.TXFIFOThreshold=TXFIFO_THRESHOLD_EMPTY
PB5.GPIO_Label=CHARGE
RCC.PLLPoutputFreq_Value=170000000
RCC.APB1TimFreq_Value=170000000
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
RCC.LPUART1Freq_Value=170000000
USART3.DataInvertParam=ADVFEATURE_DATAINV_DISABLE
PC14-OSC32_IN.GPIO_Label=IP_LOW
SPI2.Direction=SPI_DIRECTION_2LINES
PB13.Mode=Full_Duplex_Master
PC15-OSC32_OUT.GPIOParameters=GPIO_Label
SPI1.BaudRatePrescaler=SPI_BAUDRATEPRESCALER_256
PA4.GPIO_Label=CS_LTC
ProjectManager.CustomerFirmwarePackage=
PC14-OSC32_IN.Locked=true
PF1-OSC_OUT.Signal=GPIO_Input
RCC.HSI48_VALUE=48000000
PB3.Locked=true
PB4.Signal=FDCAN3_TX
RCC.HRTIM1Freq_Value=170000000
PA3.Signal=USART2_RX
NVIC.FDCAN1_IT0_IRQn=true\:0\:0\:false\:true\:true\:1\:true\:true
PA5.Mode=Full_Duplex_Master
USART2.OverrunDisableParam=ADVFEATURE_OVERRUN_ENABLE
RCC.I2SFreq_Value=170000000
RCC.PLLQoutputFreq_Value=170000000
ProjectManager.ProjectFileName=fenice-bms.ioc
PB8-BOOT0.Mode=FDCANMaster
PA7.Mode=Full_Duplex_Master
PA15.GPIOParameters=GPIO_Label
Mcu.PinsNb=38
ProjectManager.NoMain=false
SPI1.IPParameters=VirtualType,Mode,Direction,CalculateBaudRate,VirtualNSS,BaudRatePrescaler
PC13.Locked=true
PC13.Signal=GPIO_Analog
PA9.GPIO_Label=BMS_FAULT
PA11.GPIO_Label=PC_ENDED
RCC.EXTERNAL_CLOCK_VALUE=12288000
ProjectManager.DefaultFWLocation=true
PB12.Locked=true
ProjectManager.DeletePrevious=true
PF1-OSC_OUT.Locked=true
PC14-OSC32_IN.Signal=GPIO_Analog
RCC.QSPIFreq_Value=170000000
FDCAN1.IPParameters=AutoRetransmission
NVIC.USART2_IRQn=true\:0\:0\:false\:true\:true\:3\:true\:true
USART2.BaudRate=115200
PA12.GPIO_Label=PWM_IMD
RCC.FamilyName=M
PB8-BOOT0.Locked=true
USART3.OverSampling=UART_OVERSAMPLING_16
PA3.Mode=Asynchronous
PA13.Signal=SYS_JTMS-SWDIO
PA15.Locked=true
PA11.Locked=true
PC15-OSC32_OUT.Locked=true
PB11.Mode=Asynchronous
ProjectManager.TargetToolchain=Makefile
PB7.GPIOParameters=GPIO_Label
PB9.Mode=FDCANMaster
PB2.GPIOParameters=GPIO_Label
PA9.Signal=GPIO_Output
PB5.Locked=true
PB9.Locked=true
SPI2.IPParameters=VirtualType,Mode,Direction,CalculateBaudRate,VirtualNSS,BaudRatePrescaler
RCC.USBFreq_Value=170000000
RCC.LSE_VALUE=32768
PC15-OSC32_OUT.Signal=GPIO_Analog
PF1-OSC_OUT.GPIOParameters=GPIO_Label
PA1.Signal=GPIO_Output
PB1.Locked=true
PB10.Signal=USART3_TX
PB14.Signal=SPI2_MISO
PA5.Signal=SPI1_SCK
PB8-BOOT0.Signal=FDCAN1_RX
board=custom
RCC.VCOOutputFreq_Value=340000000
ProjectManager.LastFirmware=true
PB15.Mode=Full_Duplex_Master
FDCAN1.AutoRetransmission=ENABLE
RCC.ADC345Freq_Value=170000000
RCC.APB2Freq_Value=170000000
RCC.UART4Freq_Value=170000000
MxCube.Version=5.6.0
Mcu.Pin37=VP_SYS_VS_DBSignals
Mcu.Pin35=PB9
RCC.I2C1Freq_Value=170000000
Mcu.Pin36=VP_SYS_VS_Systick
SPI1.Mode=SPI_MODE_MASTER
PC13.GPIOParameters=GPIO_Label
VP_SYS_VS_DBSignals.Signal=SYS_VS_DBSignals
RCC.FDCANFreq_Value=170000000
RCC.RNGFreq_Value=170000000
Mcu.Pin30=PB4
PA1.GPIO_Label=MUX_A3
PF1-OSC_OUT.GPIO_Label=CARD_INSERT
PA10.GPIOParameters=GPIO_Label
VP_SYS_VS_Systick.Mode=SysTick
Mcu.Pin33=PB7
Mcu.Pin34=PB8-BOOT0
Mcu.Pin31=PB5
Mcu.Pin32=PB6
PA9.Locked=true
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PA4.GPIOParameters=GPIO_Label
RCC.UART5Freq_Value=170000000
ProjectManager.FreePins=false
RCC.IPParameters=ADC12Freq_Value,ADC345Freq_Value,AHBFreq_Value,APB1Freq_Value,APB1TimFreq_Value,APB2Freq_Value,APB2TimFreq_Value,CRSFreq_Value,CortexFreq_Value,EXTERNAL_CLOCK_VALUE,FCLKCortexFreq_Value,FDCANFreq_Value,FamilyName,HCLKFreq_Value,HRTIM1Freq_Value,HSE_VALUE,HSI48_VALUE,HSI_VALUE,I2C1Freq_Value,I2C2Freq_Value,I2C3Freq_Value,I2C4Freq_Value,I2SFreq_Value,LPTIM1Freq_Value,LPUART1Freq_Value,LSCOPinFreq_Value,LSE_VALUE,LSI_VALUE,MCO1PinFreq_Value,PLLM,PLLN,PLLPoutputFreq_Value,PLLQoutputFreq_Value,PLLRCLKFreq_Value,PWRFreq_Value,QSPIFreq_Value,RNGFreq_Value,SAI1Freq_Value,SYSCLKFreq_VALUE,SYSCLKSource,UART4Freq_Value,UART5Freq_Value,USART1Freq_Value,USART2Freq_Value,USART3Freq_Value,USBFreq_Value,VCOInputFreq_Value,VCOOutputFreq_Value
ProjectManager.AskForMigrate=true
Mcu.Name=STM32G474C(B-C-E)Tx
Mcu.Pin26=PA13
Mcu.Pin27=PA14
PA2.Signal=USART2_TX
Mcu.Pin24=PA11
ProjectManager.UnderRoot=false
Mcu.Pin25=PA12
PB2.Locked=true
Mcu.Pin28=PA15
Mcu.IP6=USART2
Mcu.Pin29=PB3
Mcu.IP7=USART3
ProjectManager.CoupleFile=true
PB4.Locked=true
PB3.Signal=SYS_JTDO-SWO
PA4.Signal=SPI1_NSS
RCC.SYSCLKFreq_VALUE=170000000
PB5.Signal=GPIO_Input
Mcu.Pin22=PA9
Mcu.Pin23=PA10
PA1.Locked=true
Mcu.Pin20=PB14
Mcu.Pin21=PB15
PA10.Locked=true
NVIC.ForceEnableDMAVector=true
KeepUserPlacement=false
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PA13.Locked=true
ProjectManager.CompilerOptimize=6
PA11.Signal=GPIO_Output
PA14.Signal=SYS_JTCK-SWCLK
PB2.GPIO_Label=MUX_A0
ProjectManager.HeapSize=0x800
PA0.GPIOParameters=GPIO_Label
Mcu.Pin15=PB2
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.Pin16=PB10
Mcu.Pin13=PB0
Mcu.Pin14=PB1
Mcu.Pin19=PB13
ProjectManager.ComputerToolchain=false
Mcu.Pin17=PB11
RCC.HSI_VALUE=16000000
Mcu.Pin18=PB12
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
Mcu.Pin11=PA6
Mcu.Pin12=PA7
RCC.PLLM=RCC_PLLM_DIV4
RCC.PLLN=85
Mcu.Pin10=PA5
PB7.Locked=true
PA2.Mode=Asynchronous
RCC.PWRFreq_Value=170000000
PF0-OSC_IN.Signal=GPIO_Output
PF0-OSC_IN.GPIOParameters=GPIO_Label
RCC.I2C2Freq_Value=170000000
RCC.APB1Freq_Value=170000000
PB0.Signal=GPIO_Output
ProjectManager.DeviceId=STM32G474CETx
PB12.GPIOParameters=GPIO_Label
PB12.Signal=SPI2_NSS
ProjectManager.LibraryCopy=0
PB1.GPIOParameters=GPIO_Label
PA7.Signal=SPI1_MOSI
